"use strict";

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    Example: await queryInterface.bulkInsert(
      "HarmResults",
      [
        {
          post_id: 1,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 2,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 3,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 4,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 5,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 6,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 7,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 8,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 9,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 10,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 11,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 12,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 13,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 14,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 15,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 16,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 17,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 18,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 19,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 20,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 21,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 22,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 23,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 24,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 25,
          message:
            "Покупайте эти вещи повторно, чтобы снизить общий экологический след. Однако, лучше избегать активной поддержки в таких случаях.",
          color: "purple",
          ecoStatus:
            "Высокая вредность. Эти вещи сложно перерабатываются, поэтому лучше покупать их повторно.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 26,
          message:
            "Возможно, выбирать более устойчивые варианты, но если они недоступны, эти вещи могут служить приемлемым компромиссом в балансе между стилем и устойчивостью.",
          color: "yellow",
          ecoStatus:
            "Умеренная вредность. Существуют более устойчивые альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 27,
          message:
            "Возможно, выбирать более устойчивые варианты, но если они недоступны, эти вещи могут служить приемлемым компромиссом в балансе между стилем и устойчивостью.",
          color: "yellow",
          ecoStatus:
            "Умеренная вредность. Существуют более устойчивые альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 28,
          message:
            "При возможности выбирайте вещи с более низкой экологической оценкой. Однако, если нет доступных альтернатив, это всё же лучше, чем более вредные варианты.",
          color: "yellow",
          ecoStatus:
            "Средняя вредность. Есть лучшие альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 29,
          message:
            "При возможности выбирайте вещи с более низкой экологической оценкой. Однако, если нет доступных альтернатив, это всё же лучше, чем более вредные варианты.",
          color: "yellow",
          ecoStatus:
            "Средняя вредность. Есть лучшие альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 30,
          message:
            "При возможности выбирайте вещи с более низкой экологической оценкой. Однако, если нет доступных альтернатив, это всё же лучше, чем более вредные варианты.",
          color: "yellow",
          ecoStatus:
            "Средняя вредность. Есть лучшие альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 31,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 32,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 33,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 34,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 35,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 36,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 37,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 38,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 39,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 40,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 41,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 42,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 43,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 44,
          message:
            "Сложно перерабатываемые материалы требуют повторного использования. Приобретайте такие вещи повторно, но старайтесь избегать активной поддержки и выбирать более устойчивые альтернативы, если это возможно.",
          color: "purple",
          ecoStatus:
            "Критически высокая вредность. Эти вещи сложно перерабатываются, но их повторное использование важно.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 45,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 46,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 47,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 48,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 49,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 50,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 51,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 52,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 53,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 54,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 55,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 56,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 57,
          message:
            "Покупайте эти вещи повторно, чтобы снизить общий экологический след. Однако, лучше избегать активной поддержки в таких случаях.",
          color: "purple",
          ecoStatus:
            "Высокая вредность. Эти вещи сложно перерабатываются, поэтому лучше покупать их повторно.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 58,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 59,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 60,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 61,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 62,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 63,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 64,
          message:
            "При возможности выбирайте вещи с более низкой экологической оценкой. Однако, если нет доступных альтернатив, это всё же лучше, чем более вредные варианты.",
          color: "yellow",
          ecoStatus:
            "Средняя вредность. Есть лучшие альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 65,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 66,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 67,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 68,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 69,
          message:
            "При возможности выбирайте вещи с более низкой экологической оценкой. Однако, если нет доступных альтернатив, это всё же лучше, чем более вредные варианты.",
          color: "yellow",
          ecoStatus:
            "Средняя вредность. Есть лучшие альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 70,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 71,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 72,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 73,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 74,
          message:
            "При возможности выбирайте вещи с более низкой экологической оценкой. Однако, если нет доступных альтернатив, это всё же лучше, чем более вредные варианты.",
          color: "yellow",
          ecoStatus:
            "Средняя вредность. Есть лучшие альтернативы, но эти вещи могут быть приемлемыми.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 75,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
        {
          post_id: 76,
          message:
            "Отличный выбор! Эти материалы и изделия легко утилизировать, поощряя устойчивость.",
          color: "green",
          ecoStatus:
            "Низкая вредность. Эти вещи легко перерабатываются и поддерживают экологию.",
          createdAt: new Date(),
          updatedAt: new Date(),
        },
      ],
      {}
    );
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete("HarmResults", null, {});
  },
};
